#include "lcd12864.h"
#include "lib_12864.h"
/***************************************************************
函数：带有参数的延时函数
功能：起不同时间的延时
注意：注意时间与单片机的机器周期的时间差距，
	  这个具体的时间还是得根据不同情况调整
***************************************************************/
void LCD_Delayms(unsigned int t) 			   
{ 
	unsigned int i,j;
	for(i=0;i<t;i++)		  
		for(j=0;j<50;j++);
}
/**************************************************************/

/***************************************************************
* 函数名称：Lcd_Show_On()
* 功    能：LCD显示开
* 入口参数：无
* 出口参数：无
***************************************************************/
void Lcd_Show_On()
{  
   LCD_Port=0x3f;
   RS=0;
   RW=0;
   E=1;
   E=0;  
}
/**************************************************************/

/********************************************************************************************
* 函数名称：Lcd_Show_Off()
* 功    能：LCD显示关
* 入口参数：无
* 出口参数：无
*********************************************************************************************/
void Lcd_Show_Off()
{  
   LCD_Port=0x3e;
   RS=0;
   RW=0;
   E=1;
   E=0;  
}
/********************************************************************************************
* 函数名称：Lcd_Set_X(unsigned char x)
* 功    能：LCD设置X坐标
* 入口参数：x 
* 出口参数：无
*********************************************************************************************/
void Lcd_Set_X(unsigned char x)
{  
   LCD_Port=0xb8|x;
   RS=0;
   RW=0;
   E=1;
   E=0;  
}
/********************************************************************************************
* 函数名称：Lcd_Set_Y(unsigned char y)
* 功    能：LCD设置Y坐标
* 入口参数：y
* 出口参数：无
*********************************************************************************************/
void Lcd_Set_Y(unsigned char y)
{  
   LCD_Port=0x40|y;
   RS=0;
   RW=0;
   E=1;
   E=0;  
}
/********************************************************************************************
* 函数名称：Lcd_Set_X_Y(unsigned char x, unsigned char y )
* 功    能：LCD设置x y坐标
* 入口参数：x y
* 出口参数：无
*********************************************************************************************/
void Lcd_Set_X_Y(unsigned char x, unsigned char y)
{  
   if( y<64 )
      { CS1=0; CS2=1; Lcd_Set_Y( y ); }
   else
      { CS1=1; CS2=0; Lcd_Set_Y( y-64 );  }
    Lcd_Set_X( x);
}
/********************************************************************************************
* 函数名称：Lcd_Write_CMD()
* 功    能：写指令代码
* 入口参数：无
* 出口参数：无
*********************************************************************************************/
void Lcd_Write_CMD(unsigned char dat)
{  
   LCD_Port=dat;
   RS=0;
   RW=0;
   E=1;
   E=0;  
}
/********************************************************************************************
* 函数名称：Lcd_Write_DAT()
* 功    能：写数据
* 入口参数：无
* 出口参数：无
*********************************************************************************************/
void Lcd_Write_DAT(unsigned char dat)
{  
   LCD_Port=dat;
   RS=1;
   RW=0;
   E=1;
   E=0;  
}
/****************************************************************************
*功能:显示16X8字符(字母/数字/符号)         
*入口参数:
*出口参数:
****************************************************************************/
void Lcd_Show_Char(unsigned char hang, unsigned char lie, unsigned char dat )
{
   unsigned char i , j,temp,x,y,pianyi;
	 x=hang;y=lie;
	pianyi=dat-' ';
   temp=y;
	
      for( i=0; i<2; i++ )
      {
         x+=i;
	     y=temp;
         for( j=0;j<8;j++ )
         {
            Lcd_Set_X_Y( x, y ); y++;
            Lcd_Write_DAT( ZIFU[ pianyi*16+i*8 + j] );  
         } 
      }
}
void Lcd_Show_String(unsigned char hang, unsigned char lie, unsigned char *p )
{
	unsigned char j=0;
	while (p[j]!='\0')
	{		Lcd_Show_Char(hang,lie,p[j]);
			lie+=8;
		if(lie>120){lie=0;hang+=2;}
			j++;
	}
}

/****************************************************************************
* 功能：显示整型数据    
* 入口参数：
* 出口参数：无
****************************************************************************/
void Lcd_Show_Num(unsigned char hang, unsigned char lie, unsigned int dat)
{
	unsigned int a,b;
	unsigned char i=1;
	a = dat;
	b = dat;
	while((a/10)!=0)
	{
		a /= 10;
		i++;
	}
	for(i;i>0;i--)
	{
		Lcd_Show_Char(hang,(lie+8*(i-1)),(b%10+'0'));
		b /=10;
		if(lie>120){lie=0;hang+=2;}
	}
}


/****************************************************************************
* 功能：显示浮点型数据    
* 入口参数：
* 出口参数：无
****************************************************************************/
void Lcd_Show_floatNum(unsigned char hang, unsigned char lie, float dat,unsigned char kept)
{
	float a;
	unsigned int b,c;
	unsigned char i=1,j;
	a = dat;
	for(j=0;j<kept;j++) 
	{
		a *= 10;
	}
	b = a;
	c = a;
	while((b/10)!=0)
	{
		b /= 10;
		i++;
	}
	i += 1;
	for(i;i>0;i--)
	{
		if(kept==0)
		{
			Lcd_Show_Char(hang,(lie+8*(i-1)),'.');
		}
		else
		{
			Lcd_Show_Char(hang,(lie+8*(i-1)),(c%10+'0'));
			c /=10;
		}
		if(lie>120){lie=0;hang+=2;}
		kept --;
	}
}

/****************************************************************************
* 功能：显示16*16字符（汉字）       
* 入口参数：
* 出口参数：无
****************************************************************************/
void Lcd_Show_Chinese( unsigned char hang, unsigned char lie, unsigned char num )
{
   unsigned char i,j,temp,x,y ;
	 x=hang;y=lie;
   temp=y;

      for( i=0; i<2; i++ )
      {
         x+=i;
	     y=temp;
         for( j=0;j<16;j++ )
         {
            Lcd_Set_X_Y( x, y ); y++;
            Lcd_Write_DAT( HANZI[num][ i*16 + j] );  
         } 
      }
}
/****************************************************************************
* 名称：Lcd_Clear(void)
* 功能：清屏        
* 入口参数：无
* 出口参数：无
****************************************************************************/
void Lcd_Clear()
{
   unsigned char i,j;
   CS1=0;CS2=0;
   for(i=0;i<8;i++)
   {
      Lcd_Set_X( i );
      Lcd_Set_Y( 0 );
      for(j=0;j<64;j++)
         Lcd_Write_DAT(0x00);
   }
}
/*******************************************************************************************
* 函数名称：Lcd_Initial()
* 功    能：初始化LCD
* 入口参数：无
* 出口参数：无
*********************************************************************************************/
void Lcd_Init()
{  
   Lcd_Show_Off();
   Lcd_Write_CMD(0xb8);     //Page_Add
   Lcd_Write_CMD(0x40);     //Col_Add
   Lcd_Write_CMD(0xc0);     //Start_Line
   Lcd_Show_On();
   Lcd_Clear();
}

